from collections import OrderedDict

PROTEIN_TOKS = OrderedDict([
    ('A', [ 0, 'Ala', '丙氨酸', 67]),
    ('C', [ 1, 'Cys', '半胱氨酸', 86]),
    ('D', [ 2, 'Asp', '天冬氨酸', 91]),
    ('E', [ 3, 'Glu', '谷氨酸', 109]),
    ('F', [ 4, 'Phe', '苯丙氨酸', 135]),
    ('G', [ 5, 'Gly', '甘氨酸', 48]),
    ('H', [ 6, 'His', '组氨酸', 118]),
    ('I', [ 7, 'Ile', '异亮氨酸', 124]),
    ('K', [ 8, 'Lys', '赖氨酸', 135]),
    ('L', [ 9, 'Leu', '亮氨酸', 124]),
    ('M', [10, 'Met', '甲硫氨酸', 124]),
    ('N', [11, 'Asn', '天冬酰胺', 96]),
    ('P', [12, 'Pro', '脯氨酸', 90]),
    ('Q', [13, 'Gln', '谷氨酰胺', 114]),
    ('R', [14, 'Arg', '精氨酸', 148]),
    ('S', [15, 'Ser', '丝氨酸', 73]),
    ('T', [16, 'Thr', '苏氨酸', 93]),
    ('V', [17, 'Val', '缬氨酸', 105]),
    ('W', [18, 'Trp', '色氨酸', 163]),
    ('Y', [19, 'Tyr', '酪氨酸', 141]),
])